public static class StoryScripts
{
    public static readonly string[][] StageStart =
    {
        new[]
        {
            "도로시 : 으앙! 머리야…여기가 어디지…주변을 둘러보자",
            "(A, D 키로 좌우 이동, 스페이스를 누르면 점프할 수 있습니다.)",
            "(E 키로 대화를 할 수 있습니다.)"

        },
        new[]
        {
            "",
            ""
        },
    };

    public static readonly string[][] NormalNPCTalk =
    {
        new[]
        {
            "",
        },
    };

    public static readonly string[] QuestNames =
    {
        "퀘스트 1 : 착한 마녀 글린다가 있는 곳으로 도착하자",
        "퀘스트 2 : 맵에 숨겨 져 있는 가위를 찾아서 허수아비를 풀어주자.",
    };

    public static readonly string[] QuestReward =
    {
        "퀘스트1 : 진행 보상을 획득했습니다! [구두]",
        "퀘스트1 : 길동무가 생겼습니다! 허수아비 특성 : 빠른걸음, 독면역"
    };

    public static readonly string[][] QuestStart =
    {
        new[]
        {
            "도로시 : 당신은 누구지?",
            "???: 난 북쪽의 마녀, 글린다.",
            "일단 고마워, 너가 떨어진 집 밑에 나쁜 동쪽 마녀가 깔려 죽게 되었어!",
            "그동안 동쪽마녀 때문에 고통받은 난쟁이들이 널 영웅으로 생각해.",
            "너는 어떤 마녀야? 좋은 마녀? 나쁜 마녀?",
            "도로시: 나 마녀 아닌데…여기는 어딘데!! 집갈래 집보내줘!",
            "글린다: 그래? 하지만 먼치킨마을의 난쟁이들은 너가 좋은 마녀인지 나쁜 마녀인지 알고 싶다는걸?",
            "먼치킨들의 의심이 많아서 너가 이 장애물을 넘어 저기까지 오면 너가 착한 마녀라는 걸 인정해 줄거야!"
        },
        new[]
        {
            "도로시: 오…리얼해",
            "허수아비: 응 아니야.",
            "도로시: 우왁!!! 말을 하네",
            "허수아비: 응 아니야.",
            "도로시 : 뭐지? 킹받게 진짜!",
            "말을 응 아니야 밖에 못해? 잼민이야?",
            "뇌 없어?",
            "허수아비 : 응 맞아.",
            "도로시: 진짜 뇌가 없어?",
            "허수아비: (꿈틀 꿈틀) 으…으...뇌...줘…",
            "도로시: 뭐 풀어달라고?",
            "허수아비: (끄덕)",
            "도로시: 뇌 갖고 싶다고?",
            "허수아비: (끄덕)",
        },
        new[]
        {
            "도로시: 우오…배고픈데 저거 사과 먹고 싶다…",
            "허수아비: 으어어…",
            "도로시:” 따줘. “",
            "허수아비: 으!",
            "도로시: 어? 여기 이거 뭐야… 나무꾼? 근데 깡통?(뒤에서 도로시가 허수아비 쪽으로 걸어온다.)",
            "음…'기름 부족?'",
            "기름을 넣으면 움직이는 건가?"
        }
    };

    public static readonly string[][] QuestEnd =
    {
        new[]
        {
            "도로시 : 헉헉.. 야 장난해? 집 가는 거 알려 달라고요. 이 마녀야",
            "글린다: 오옹~ 그래그래 먼치킨들도 널 영웅으로 인정 했어!",
            "도로시 : 됐고 집.",
            "글린다 : 음…",
            "으..",
            "도로시: 설마 너…",
            "집가는 법 모르지?!",
            "북쪽 마녀: 엉 사실 잘 몰라… 하지만 에메랄드 시티에 사는 오즈의 마법사라면 알지도...?",
            "도로시: 후… 그게 누군데",
            "북쪽 마녀: 자 여기 구두 선물! 이게 널 오즈의 마법사한테 데려가 줄거야.",
            "이 구두는 너가 죽인 동쪽 마녀 남긴 유산이야. 그럼 난 이만 안뇽~",
            "도로시: 아 진짜!!"
        },
        new[]
        {
            "허수아비: 우우웅....❤ 거 마 워",
            "도로시: 그래 이제 그럼 안녕~",
            "허수아비: 으으으!!",
            "도로시: ?!",
            "어디가냐고? 나는 만능 마법사 오즈한테 가고 있어. 가면 너한테 줄 뇌도 있지 않을까?",
            "허수아비: 으응...으!",
            "도로시: 같이 가고 싶다고? 그래 그럼 같이 오즈한테 가자!"
        },
    };
}
